<!DOCTYPE html>
<html lang="en"><head><script src="/livereload.js?mindelay=10&amp;v=2&amp;port=1313&amp;path=livereload" data-no-instant defer></script>
    <title>0xbekoo</title>
    <meta content="text/html;charset=utf-8" http-equiv="Content-Type">
    <meta content="utf-8" http-equiv="encoding">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="format-detection" content="telephone=no" />
    <meta name="theme-color" content="#000084" />
    <link rel="icon" href="http://localhost:1313//favicon.ico">
    <link rel="canonical" href="http://localhost:1313/">
    
    
</head>
<body>
<nav class="navbar navbar-inverse navbar-fixed-top">
    <div class="navbar-inner">
        <div class="container">
            <button type="button" class="btn btn-navbar" data-toggle="collapse" data-target=".nav-collapse"></button>
            <a class="brand" href="http://localhost:1313/">0xbekoo</a>
            <div class="nav-collapse collapse">
                <ul class="nav">
                    
                    
                        
                            <li>
                                <a href="/docs/">
                                    
                                    <span>Documentation</span>
                                </a>
                            </li>
                        
                    
                        
                            <li>

<p>Birkaç gün önce SSDT tablosu üzerine bir <a href="https://0xbekoo.github.io/docs/winkernel-dev/wkd-ssdt/">döküman</a> paylaşmıştım. Bu dökümanda temel olarak SSDT&rsquo;nin ne olduğunu, adreslerin nasıl hesaplandığı vs anlatmıştım. Dökümanın son kısmında ise öğrendiğimiz şeylerin bir kernel sürücüsünü hazırlamıştık.</p>
<p>Ancak SSDT için bu dökümanı hazırladıktan sonra SSDT için bu bilgiler benim için yetersiz gelmişti. Eğer benim gibi bir konunun derinine inmeye meraklı iseniz benimle kalın. Çünkü Windows Kernel&rsquo;da Syscall&rsquo;ların nasıl işlendiğini vs. yakından göreceğiz; Hem statik analiz hem de dinamik analizle!</p>
<p>Bu blogta, temel bilgiler olan NTAPI&rsquo;ların ne olduğu ve syscall&rsquo;ın nasıl işlendiği vs. gibi konulara yer vermeyeceğim. Zira <a href="https://0xbekoo.github.io/tr/docs/malware-dev/ntapi-injection/"><strong>NTAPI Injection</strong></a> dökümanında NTAPI&rsquo;in ne olduğunu, <a href="https://0xbekoo.github.io/tr/docs/malware-dev/direct-syscalls"><strong>Direct Systemcalls</strong></a> dökümanında bir syscall&rsquo;ın nasıl işlendiğini ve  temel olarak <a href="https://0xbekoo.github.io/tr/docs/winkernel-dev/wkd-ssdt/"><strong>SSDT</strong></a> dökümanında SSDT ve kernel&rsquo;da syscall&rsquo;ın nasıl işlendiğini daha önceden anlattım. Eğer temel şeylerle öğrenmeye başlayacaksınız bu dökümanlardan başlamak sizin için daha iyi olacaktır. Bu blogta nihai amacımız kernel alanında bir syscall&rsquo;ın nasıl işlendiğini detaylı bir şekilde görmek olacak.</p>
<h2 id="statik-analiz"><strong>Statik Analiz</strong></h2>
<p>Bir syscall işlendiğinde, ntdll.dll&rsquo;den syscall yapıldığında kernel alanına geçişte ilk durağın KiSystemCall64 olduğunu biliyoruz. Statik olarak analizimizi buradan başlayacağız. IDA ortamında ntoskrnl.exe analiz etmekle başlayalım.</p>
<h3 id="kisystemserviceuser"><strong>KiSystemServiceUser</strong></h3>
<p><strong>KiSystemCall64/KiSystemCall64Shadow</strong> kodlarına göz attığınızda akışın <strong>KiSystemServiceUser</strong>&lsquo;a doğru yönlendiğini göreceksiniz:</p>
<p><img src="../../../images/posts/syscall-journey/img1.png" alt=""></p>
<p><strong>KiSystemServiceUser</strong>&lsquo;da syscall&rsquo;ın işlenmesi için hazırlıklar yapılıyor:</p>
<p><img src="../../../images/posts/syscall-journey/img2.png" alt=""></p>
<p>Burada odağımızı <code>mov rbx,gs:188h</code> kısmına çevirmemiz gerekiyor çünkü önemli bir yapı olan _KPCR yapısı içerisinden bir KTHREAD yapısı alınmakta.</p>
<p>Bu yapının ne olduğunu anlamak için <a href="https://www.geoffchappell.com/studies/windows/km/ntoskrnl/inc/ntos/amd64_x/kpcr.htm">Geoff Chappell, Software Analyst</a>&lsquo;ın açıklamasından yararlanabiliriz:</p>
<blockquote>
<p>&ldquo;KPCR yapısı, <strong>Kernel Processor Control Region</strong> anlamına gelir. Kernel, her mantıksal işlemci için bir KPCR yapısı tutar. KPCR, işlemci mimarisine son derece özeldir.&rdquo;</p>
</blockquote>
<p>Yani kısaca aklımızda şöyle kalabilir bu yapıda işlemciye özel verileri saklamak için kullanılır. Yani baya önemli bir yapı.</p>
<p>x64 sistemlerde KPCR yapısı, gs:0 alanına işaret eder:</p>
<pre tabindex="0"><code>kd&gt; dt nt!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x000 GdtBase          : Ptr64 _KGDTENTRY64
   +0x008 TssBase          : Ptr64 _KTSS64
   +0x010 UserRsp          : Uint8B
   +0x018 Self             : Ptr64 _KPCR
   +0x020 CurrentPrcb      : Ptr64 _KPRCB
   +0x028 LockArray        : Ptr64 _KSPIN_LOCK_QUEUE
   +0x030 Used_Self        : Ptr64 Void
   +0x038 IdtBase          : Ptr64 _KIDTENTRY64
   +0x040 Unused           : [2] Uint8B
   +0x050 Irql             : UChar
   +0x051 SecondLevelCacheAssociativity : UChar
   +0x052 ObsoleteNumber   : UChar
   +0x053 Fill0            : UChar
   +0x054 Unused0          : [3] Uint4B
   +0x060 MajorVersion     : Uint2B
   +0x062 MinorVersion     : Uint2B
   +0x064 StallScaleFactor : Uint4B
   +0x068 Unused1          : [3] Ptr64 Void
   +0x080 KernelReserved   : [15] Uint4B
   +0x0bc SecondLevelCacheSize : Uint4B
   +0x0c0 HalReserved      : [16] Uint4B
   +0x100 Unused2          : Uint4B
   +0x108 KdVersionBlock   : Ptr64 Void
   +0x110 Unused3          : Ptr64 Void
   +0x118 PcrAlign1        : [24] Uint4B
   +0x180 Prcb             : _KPRCB
</code></pre><p>Şimdi odağımızı çevirdiğimiz koda baktığımızda ilk olarak <strong>gs:188</strong> işaret edilen bölüm alınmakta. Windbg&rsquo;dan elde ettiğimiz çıktı ile KPCR yapıya baktığımızda bu kısmın <strong>0x180 Prcb _KPRCB</strong> alanından bir bölüme işaret ettiğini anlayabiliriz:</p>
<pre tabindex="0"><code>dt nt!_KPRCB
   +0x000 MxCsr            : Uint4B
   +0x004 LegacyNumber     : UChar
   +0x005 ReservedMustBeZero : UChar
   +0x006 InterruptRequest : UChar
   +0x007 IdleHalt         : UChar
   +0x008 CurrentThread    : Ptr64 _KTHREAD
</code></pre><p><code>gs:188h</code> olduğu için KRPCB yapısından KTHREAD yapısına işaret eden <strong>+0x008 CurrentThread</strong> alınmakta. <strong>KTHREAD</strong> yapısının ne olduğunu anlamak için yine <a href="https://www.geoffchappell.com/studies/windows/km/ntoskrnl/inc/ntos/ke/kthread/index.htm">Geoff Chappell</a>&lsquo;in makalesinden yararlanabiliriz:</p>
<blockquote>
<p>&ldquo;KTHREAD yapısı, ETHREAD yapısının çekirdek kısmıdır. ETHREAD, Nesne Yöneticisi (Object Manager) aracılığıyla sunulan iş parçacığı nesnesidir. KTHREAD ise bunun temel çekirdeğini oluşturur.&rdquo;</p>
</blockquote>
<p>Yani bildiğimiz ETHREAD yapısının kernel versiyonu. Thread yürütme/yönetimi için Kernel tarafından ihtiyaç duyulan birçok önemli bilgiyi içeriyor bu yapı. Bunlardan biri de bu yapıda TEB&rsquo;in adresi bulunmasıdır:</p>
<pre tabindex="0"><code>kd&gt; dt nt!_KTHREAD
...
   +0x080 SystemCallNumber : Uint4B
   +0x084 ReadyTime        : Uint4B
   +0x088 FirstArgument    : Ptr64
...
   +0x0f0 Teb              : Ptr64 Void
</code></pre><p><strong>KiSystemServiceUser</strong>&lsquo;ın son kısımlarında ise KTHREAD yapısından <strong>SystemCallNumber</strong> ve <strong>FirstArgument</strong> bayrakların ayarlandığını görebiliriz:</p>
<p><img src="../../../images/posts/syscall-journey/img3.png" alt=""></p>
<p>Bundan sonra akış <strong>KiSystemServiceStart</strong>&lsquo;a yönlendiriliyor.</p>
<h3 id="syscall-numarasının-belirlenmesi-kisystemservicestart">Syscall Numarasının Belirlenmesi: <strong>KiSystemServiceStart</strong></h3>
<p>Yapılan syscall&rsquo;ın ilk temelleri burada atılmaya başlanıyor.</p>
<p>Bir syscall yapıldığında, içerdiği syscall index&rsquo;le beraber <strong>Table Identifier</strong> bilgisi de içermektedir. Kafanız karışmaması için bunu bir fotoğraf üzerinden anlatayım:</p>
<p><img src="../../../images/posts/syscall-journey/byte-diagram.png" alt=""></p>
<p>Bitler sağdan sola okunduğundan 0 ila 11 bit System Call Index&rsquo;ın bitini barındırır. 12 ila 13 bit arası ise Table Identifier&rsquo;ın biti barındırır. Bundan sonraki bitler kullanılmaz. Şimdi ki durağımız olan <strong>KiSystemServiceStart</strong> tam da bu konuyla alakalı:</p>
<p><img src="../../../images/posts/syscall-journey/img4.png" alt=""></p>
<p>Şimdi kafanızda daha iyi oturması için bir senaryo oluşturalım. Diyelim ki ntdll.dll&rsquo;den NtOpenProcess için syscall yapıldı. Bu senaryoda Syscall&rsquo;ın yapılmasını şöyle düşünmenizi istiyorum: içi beyaz sünger dolu kutu gibi düşünmenizi istiyorum.</p>
<p>Diyelim ki biri tarafından içinde iki tane hediye olan bu kutuyu aldınız. İçini açtığınızda en üstünde gereksiz beyaz sünger olduğunu gördüğünüz. Beyaz süngerin altında ise iki tane hediye bulunmakta. Normal bir insan gibi  üsteki süngerleri kaldırır ve altında duran hediyeleri alırız demi?</p>
<p>Syscall çağırısı kernel alanından KiSystemServiceStart&rsquo;a ulaştıktan sonra KiSystemServiceStart fonksiyonu aynen bunu yapıyor. Bu gereksiz süngerleri (kabaca kullanılmayan bitleri) kaldırıyor ve ilk olarak birinci eşyayı (Table Identifier) ve ikinci eşyayı (System Call Index) alıyor.</p>
<p>Bu örnekten sonra fonksiyona tekrar göz atalım:</p>
<p><img src="../../../images/posts/syscall-journey/img5.png" alt=""></p>
<p>Örneğimizde NtOpenProcess&rsquo;i söylemiştim. NtOpenProcess&rsquo;in ssn numarası <strong>0x26</strong>&lsquo;dır. Yani bu kısımda eax&rsquo;ın 26h değeri barındırdığını düşünürsek:</p>
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-asm" data-lang="asm"><span style="display:flex;"><span><span style="color:#a6e22e">mov</span> <span style="color:#66d9ef">edi</span>,<span style="color:#66d9ef">eax</span>     <span style="color:#75715e">; eax = 0x26 (0010 0110)
</span></span></span><span style="display:flex;"><span><span style="color:#a6e22e">shl</span> <span style="color:#66d9ef">edi</span>,<span style="color:#ae81ff">7</span>
</span></span></code></pre></div><p>Burada yapılan işlem tam olarak aşağıda gösterildiği gibidir:</p>
<p><img src="../../../images/posts/syscall-journey/img6.png" alt=""></p>
<p>Yani 7 bit sağ kaydırmadan sonra elde ettiğimiz değer tamamen 0 oluyor ve edi register&rsquo;ı 0x0 değeri almış olur. Gereksiz bitleri kaldırdığımıza göre Table Identifier&rsquo;ı alalım:</p>
<pre tabindex="0"><code>and edi,20h     ; edi = 0x20 (1000 00)
</code></pre><p>Burada yapılan işlem tam olarak aşağıda gösterildiği gibidir:</p>
<p><img src="../../../images/posts/syscall-journey/img7.png" alt=""></p>
<p>Yani NtOpenProcess için alacağımız Table Identifier&rsquo;ın sonucu 0x0 olacaktır.</p>
<p>Fakat bu durum her zaman böyle değildir. SSN numarası eğer 1000h ile 1FFFh arasındaysa Table Identifier değeri 0x20 olacaktır. Bu API&rsquo;lar Windows GUI ile ilgilidir.</p>
<p>Eğer ki Syscall Numarası 0h ile FFFh arasındaysa, örneğimizde olduğu gibi Table Identifier değeri 0x0 olacaktır. Bu API&rsquo;lar ise ntdll.dll ile ilgilidir.</p>
<p>Şimdi ise Systemcall numarasının alındığı kısma geldik:</p>
<pre tabindex="0"><code>and eax,0FFFh   // eax = 0x26 (0010 0110)
</code></pre><p>Burada yapılan işlem ise aşağıda gösterilmiştir:</p>
<p><img src="../../../images/posts/syscall-journey/img8.png" alt=""></p>
<p><strong>0010 0110</strong> (Hex: 0x26) sonucunu elde ediyoruz. Bu ise NtOpenProcess&rsquo;in Systemcall numarasıdır.</p>
<p>Kafamızda daha iyi oturması için herhangi bir GUI ile alakalı bir API seçelim ve bu adımları ona da uygulayalım. <strong>win32u.dll</strong>&lsquo;den GUI ile alakalı bir API seçelim ve bu seçtiğimiz API&rsquo;in Table Identifier değerini ve SSN&rsquo;i hesaplayalım:</p>
<p><img src="../../../images/posts/syscall-journey/img16.png" alt=""></p>
<p><strong>NtUserCreateWindowEx</strong> GUI ile alakalı bir API&rsquo;dir ve win32u.dll&rsquo;in içinde bulunur. SSN Numarası ise <strong>106F</strong>. Bunun işlendiği varsayarsak:</p>
<pre tabindex="0"><code>mov edi,eax ; eax = 0x106F (0001 0000 0110 1111)
shl edi,7
</code></pre><p>Bu işlem tam olarak şöyle:</p>
<p><img src="../../../images/posts/syscall-journey/img17.png" alt=""></p>
<p>7 bit sola kaydırdığımızda aldığımız sonuç <strong>20h</strong> oluyor. Daha sonra Table Identifier değerini alalım:</p>
<pre tabindex="0"><code>and edi,20h ; edi = 0x20 (1000 00)
</code></pre><p>Bu kodda yapılan işlem aşağdaki gibidir:</p>
<p><img src="../../../images/posts/syscall-journey/img18.png" alt=""></p>
<p>Yani Table Identifier değeri 0x20 (32) oluyor.</p>
<p>Yani her zaman Table Identifier değeri 0x0 olmuyor. Önceden anlattığım gibi, eğer GUI ile alakalı bir API&rsquo;in ssn numarası işleniyorsa table Identifier değeri 0x20 olacaktır. 0x0 olması takdirde ntdll.dll&rsquo;in içerisinden bir API olduğunu anlayabiliriz.</p>
<p>Son olarak GUI API&rsquo;in SSN numarasını çıkaralım:</p>
<pre tabindex="0"><code>and eax,0FFFh   ; eax = 0x106F
</code></pre><p>Bu kodda yapılan işlem aşağıdaki gibidir:</p>
<p><img src="../../../images/posts/syscall-journey/img19.png" alt=""></p>
<p>Sonucumuz <strong>0001000001101111</strong> yani 0x106F değerine denk gelmektedir.</p>
<p>Böylece <strong>KiSystemServiceStart</strong> fonksiyonunun amacı, işlenilen syscall&rsquo;ı ve Table Identifier değerlerini çıkarmak. Bu kısımdan sonra artık akış <strong>KiSystemServiceRepeat</strong>&rsquo;e yöneliyor.</p>
<h3 id="kernel-rutinin-hesaplanması-kiservicesystemrepeat">Kernel Rutinin Hesaplanması: <strong>KiServiceSystemRepeat</strong></h3>
<p>Artık Syscall numarası belirlendikten sonra bu fonksiyonda ilk olarak SSDT&rsquo;nin adresi alınmakta:</p>
<p><img src="../../../images/posts/syscall-journey/img9.png" alt=""></p>
<p>Fakat ilgi çeken kısım ise SSDT&rsquo;nin adresi alındıktan sonra rbx&rsquo;in değerleri kontrol ediliyor. Hatırlayalım, rbx register&rsquo;ı hangi adresi tutuyordu?</p>
<p><strong>KiSystemServiceUser</strong> başlığında gördüğümüz gibi rbx register&rsquo;ı, _KPRCB altında <code>+0x008 CurrentThread    : Ptr64 _KTHREAD</code> yapıyı tutmakta. Bu yapıda neyi kontrol ettiğine bir bakalım:</p>
<pre tabindex="0"><code>&gt; dt nt!_KTHREAD
   ...
   +0x078 ThreadFlagsSpare : Pos 0, 2 Bits
   +0x078 AutoAlignment    : Pos 2, 1 Bit
   +0x078 DisableBoost     : Pos 3, 1 Bit
   +0x078 AlertedByThreadId : Pos 4, 1 Bit
   +0x078 QuantumDonation  : Pos 5, 1 Bit
   +0x078 EnableStackSwap  : Pos 6, 1 Bit
   +0x078 GuiThread        : Pos 7, 1 Bit
</code></pre><p>Bu yapıdan <strong>GuiThread</strong> flag&rsquo;ın ayarlanıp ayarlanmadığını kontrol edilmektedir. Eğer ayarlanmamışsa direkt bu koşullardan atlanır.</p>
<p>İşin garip kısmı da ileride de göreceğimiz gibi, thread ilk olarak bu rutini çalıştırdığında GUI ile alakalı bir API&rsquo;in işlenip işlenmediğini bilmiyor. Yani bir farklı deyişle, Kernel henüz mevcut Thread&rsquo;ın bir GUI fonksiyonu işleyip işlemediğini bilmiyor. Dolayasıyla sonuç ne olursa olsun ilk kısımda burası her zaman atlanacaktır. İlerideki  analizde göreceksiniz ki hesaplamalardan sonra akış, eğer GUI ile alakalı bir API işleniyorsa bu kısma tekrardan yönlendirilecek.</p>
<p><img src="../../../images/posts/syscall-journey/img10.png" alt=""></p>
