<!DOCTYPE html>
<html lang="en"><head><script src="/livereload.js?mindelay=10&amp;v=2&amp;port=1313&amp;path=livereload" data-no-instant defer></script>
    <title>0xbekoo</title>
    <meta content="text/html;charset=utf-8" http-equiv="Content-Type">
    <meta content="utf-8" http-equiv="encoding">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="format-detection" content="telephone=no" />
    <meta name="theme-color" content="#000084" />
    <link rel="icon" href="/favicon.ico">
    <link rel="canonical" href="/blogs/syscalls/">
    <noscript><style>body { visibility: visible !important; }</style></noscript>
</head>
<body>
<nav class="navbar navbar-inverse navbar-fixed-top">
    <div class="navbar-inner">
        <div class="container">
            <button type="button" class="btn btn-navbar" data-toggle="collapse" data-target=".nav-collapse"></button>
            <a class="brand" href="/">0xbekoo</a>
            <div class="nav-collapse collapse">
                <ul class="nav">
                    
                    
                        
                            <li>
                                <a href="/docs/">
                                    
                                    <span>Documentation</span>
                                </a>
                            </li>
                        
                    
                        
                            <li>

            <li><a href="#adding-breakpoint-to-kisystemcall64"><strong>Adding Breakpoint to KiSystemCall64</strong></a></li>
            <li><a href="#kisystemserviceuser"><strong>KiSystemServiceUser</strong></a></li>
            <li><a href="#kisystemservicestart"><strong>KiSystemServiceStart</strong></a></li>
            <li><a href="#kisystemservicerepeat"><strong>KiSystemServiceRepeat</strong></a></li>
            <li><a href="#kisystemservicecopyend"><strong>KiSystemServiceCopyEnd</strong></a></li>
          </ul>
        </li>
        <li><a href="#conclusion"><strong>Conclusion</strong></a></li>
      </ul>
    </li>
    <li><a href="#references"><strong>References</strong></a></li>
  </ul>
</nav>
                            </div>
                        </div>
                    </div>
                </section>
                
                <div class="single-shell__content">
                    <p>Hi everyone! Today we will dive into Syscalls in Windows Kernel. After the information I had for SSDT, this information seemed insufficient to me. Then i decided to dive in the windows kernel.</p>
<p>In this blog, we will examine that how windows kernel it works a syscall. So, i will not include what&rsquo;s <a href="https://0xbekoo.github.io/docs/malware-dev/ntapi-injection/">NTAPI</a>, <a href="https://0xbekoo.github.io/docs/malware-dev/direct-syscalls/">Syscall</a> or <a href="https://0xbekoo.github.io/docs/winkernel-dev/wkd-ssdt/">SSDT</a> etc. in this blog because i wrote many documents for these topics and if you&rsquo;re beginner in the topics, you can start with the documents mentioned.</p>
<h3 id="static-analysis"><strong>Static Analysis</strong></h3>
<p>When a syscall starts processing from ntdll.dll, the flow begins in <strong>KiSystemCall64</strong> from Windows Kernel and we will start in this part.</p>
<h4 id="preparation-phase-kisystemserviceuser"><strong>Preparation Phase: KiSystemServiceUser</strong></h4>
<p>If we take a look at <strong>KiSystemCall64/KiSystemCall64Shadow</strong>, flow is transferred to <strong>KiSystemServiceUser</strong>:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img1.png" style="width:80%" />
</div>
<p>In KiSystemServiceUser, it prepares to process the syscall:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img2.png" style="width: 44%" />
</div>
<p>We have to focus on <strong>mov rbx,gs:188h</strong> code. This offset corresponds to a critical structure that called <strong>KPCR</strong>. In the structure, it gets address of KTHREAD.</p>
<p>We can benefit article of Geoff Chappell<sup>[2]</sup> for the structure:</p>
<div style="text-align:center; font-size: 14px;">
<i>
The name KPCR stands for (Kernel) Processor Control Region. The kernel keeps a KPCR (formally a _KPCR) for each logical processor. The KPCR is highly specific to the processor architecture.
</i>
</div>
<p>KPCR structure points to gs:0 in x64 systems:</p>
<pre tabindex="0"><code>kd&gt; dt nt!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x000 GdtBase          : Ptr64 _KGDTENTRY64
   +0x008 TssBase          : Ptr64 _KTSS64
   +0x010 UserRsp          : Uint8B
   +0x018 Self             : Ptr64 _KPCR
   +0x020 CurrentPrcb      : Ptr64 _KPRCB
   +0x028 LockArray        : Ptr64 _KSPIN_LOCK_QUEUE
   +0x030 Used_Self        : Ptr64 Void
   +0x038 IdtBase          : Ptr64 _KIDTENTRY64
   +0x040 Unused           : [2] Uint8B
   +0x050 Irql             : UChar
   +0x051 SecondLevelCacheAssociativity : UChar
   +0x052 ObsoleteNumber   : UChar
   +0x053 Fill0            : UChar
   +0x054 Unused0          : [3] Uint4B
   +0x060 MajorVersion     : Uint2B
   +0x062 MinorVersion     : Uint2B
   +0x064 StallScaleFactor : Uint4B
   +0x068 Unused1          : [3] Ptr64 Void
   +0x080 KernelReserved   : [15] Uint4B
   +0x0bc SecondLevelCacheSize : Uint4B
   +0x0c0 HalReserved      : [16] Uint4B
   +0x100 Unused2          : Uint4B
   +0x108 KdVersionBlock   : Ptr64 Void
   +0x110 Unused3          : Ptr64 Void
   +0x118 PcrAlign1        : [24] Uint4B
   +0x180 Prcb             : _KPRCB
</code></pre><p>Now if we take a look at the code again, it gets 0x188 offset in KiSystemServiceUser. According the output of WinDBG, this offset corresponds to Prcb in the structure.</p>
<pre tabindex="0"><code>dt nt!_KPRCB
   +0x000 MxCsr            : Uint4B
   +0x004 LegacyNumber     : UChar
   +0x005 ReservedMustBeZero : UChar
   +0x006 InterruptRequest : UChar
   +0x007 IdleHalt         : UChar
   +0x008 CurrentThread    : Ptr64 _KTHREAD
</code></pre><p>We can see that 0x188 offset in PRCB corresponds to <strong>CurrentThread</strong>. Also we can benefit article of Geoff Chappell<sup>[3]</sup> again to understand that what&rsquo;s KTHREAD:</p>
<div style="text-align:center; font-size: 14px;">
<i>
The KTHREAD structure is the Kernel Core’s portion of the ETHREAD structure. The latter is the thread object as exposed through the Object Manager. The KTHREAD is the core of it.
</i>
</div>
<p>It&rsquo;s like equivalent of ETHREAD as Kernel Structure. Also one important detail in the structure is that it holds address of TEB:</p>
<pre tabindex="0"><code>kd&gt; dt nt!_KTHREAD
...
   +0x080 SystemCallNumber : Uint4B
   +0x084 ReadyTime        : Uint4B
   +0x088 FirstArgument    : Ptr64
...
   +0x0f0 Teb              : Ptr64 Void
</code></pre><p>In the last part of KiSystemServiceUser, we can see that it sets <strong>SystemCallNumber</strong> flag from KTHREAD Structure:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img3.png" style="width: 60%" />
</div>
<p>Also notice that the <strong>FirstParameter</strong> flag of the structure sets with rcx.</p>
<h4 id="determination-of-the-systemcall-kisystemservicestart"><strong>Determination of the Systemcall: KiSystemServiceStart</strong></h4>
<p>When a syscall processed, it contains a <strong>Table Identifier</strong> information with Syscall Index:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img4.png" style="width: 75%" />
</div>
<p>Bits are read from right to left and according the diagram above, 0 - 11 bits contains Syscall Index, while 12 - 13 bits contains Table Identifier. After bits are not used. <strong>KiSystemServiceStart</strong> function determines these bits. In other words, this function extract the syscall number:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img5.png" style="width: 70%" />
</div>
<p>Firstly, it deletes Padding Bit with 7 bits shifting to reach Table Identifier and Syscall Number. After that, it gets Table Identifier value and Syscall number. I know that it seems to be confusing but trust me this section is really simple.</p>
<p>We can create a scenario. Let&rsquo;s think that the syscall number is 0x26 (NtOpenProcess):</p>
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-asm" data-lang="asm"><span style="display:flex;"><span><span style="color:#a6e22e">mov</span> <span style="color:#66d9ef">edi</span>,<span style="color:#66d9ef">eax</span>     <span style="color:#75715e">; eax = 0x26 (0010 0110)
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span><span style="color:#a6e22e">shl</span> <span style="color:#66d9ef">edi</span>,<span style="color:#ae81ff">7</span>
</span></span></code></pre></div><p>This processes here&rsquo;s exactly as shown below:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img6.png" style="width: 85%" />
</div>
<p>After shift 7 bits to right, the Padding bits are cleared, which means that edi register is taken 0 value. Let&rsquo;s get Table Identifier Value:</p>
<pre tabindex="0"><code>and edi,20h     ; edi = 0x20 (1000 00)
</code></pre><p>This process here&rsquo;s exactly as shown below:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img7.png" style="width: 70%" />
</div>
<p>So, we can see that the Table Identifier value is 0x0 for NtOpenProcess.</p>
<p>But this isn&rsquo;t always in this case. If the SSN Number is between <strong>0x1000</strong> and <strong>0x1FFF</strong>, Table Identifier value will be 0x0 and these specific functions are related to GUI API&rsquo;s. But if the SSN Number is between <strong>0x0</strong> and <strong>0xFFF</strong>, the Table Identifier will be 0x0, as have been shown. These functions are related to ntdll.dll, such as NtOpenProcess.</p>
<p>Now let&rsquo;s extract SSN Number:</p>
<pre tabindex="0"><code>and eax,0FFFh   // eax = 0x26 (0010 0110)
</code></pre><p>This process here&rsquo;s exactly as shown below:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img8.png" style="width: 70%" />
</div>
<p>The result <strong>00100110</strong> correspond to 0x26. That&rsquo;s all!</p>
<p>Let&rsquo;s select a GUI API from <strong>win32u.dll</strong> and calculate its Table Identifier value:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img9.png" style="width: 90%" />
</div>
<p>Our target is <strong>NtUserCreateWindowEx</strong> and its SSN is 0x106F as we can see. Let&rsquo;s calculate:</p>
<pre tabindex="0"><code>mov edi,eax ; eax = 0x106F (0001 0000 0110 1111)
shl edi,7
</code></pre><p>This process is exactly like this:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img10.png" style="width: 90%" />
</div>
<p>edi register is taken 0x20 value. Now it takes Table Identifier value:</p>
<pre tabindex="0"><code>and edi,20h ; edi = 0x20 (1000 00)
</code></pre><p>Or:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img11.png" style="width: 40%" />
</div>
<p>So, as we can see that Table Identifier value is 0x20.  Like i said, the value is not always 0x0.</p>
<p>Lastly, let&rsquo;s extract the SSN Number:</p>
<pre tabindex="0"><code>and eax,0FFFh   ; eax = 0x106F
</code></pre><p>This process is exactly like this:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img12.png" style="width: 70%" />
</div>
<p>The result is <strong>0001000001101111</strong>, it correspond to 0x106F.</p>
<p>As we can see that <strong>KiSystemServiceStart</strong> has responsibility to determine Syscall Number.</p>
<h4 id="calculation-of-kernel-routine-kiservicesystemrepeat"><strong>Calculation of Kernel Routine: KiServiceSystemRepeat</strong></h4>
<p>Next section <strong>KiServiceSystemRepeat</strong> has responsibility to calculate kernel routine. Here&rsquo;s codes:</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img13.png" style="width: 50%" />
</div>
<p>Firstly, it gets address of SSDT, as we can see. Then it compares 0x78 offset of KPCR structure with 0x80 value. This offset corresponds to <strong>GuiThread</strong>:</p>
<pre tabindex="0"><code>kd&gt; dt nt!_KTHREAD
   ...
   +0x078 ThreadFlagsSpare : Pos 0, 2 Bits
   +0x078 AutoAlignment    : Pos 2, 1 Bit
   +0x078 DisableBoost     : Pos 3, 1 Bit
   +0x078 AlertedByThreadId : Pos 4, 1 Bit
   +0x078 QuantumDonation  : Pos 5, 1 Bit
   +0x078 EnableStackSwap  : Pos 6, 1 Bit
   +0x078 GuiThread        : Pos 7, 1 Bit
</code></pre><p>Thus it checks if GuiThread flag is set. if it is, then r11 will take address of <strong>KeServiceDescriptorTableFilter</strong>.</p>
<p>But there&rsquo;s a interesting situation here.  We can see that when the thread first runs this routine, it does not know if a GUI related API is being processed. So, in this context, whatever output is, it will skip it. As we will see in the following analysis,  after calculation of kernel routine, it determines whether SSN number is GUI or not and if it is, will be redirected back to the beginning of this section.</p>
<div style="text-align: center;">
  <img src="/images/posts/syscall-journey/syscall-en-blog/img14.png" style="width: 70%" />
</div>
<p>After it get address of SSDT, it compares <strong>r10+rdi+0x10. r10</strong>. r10 contains address of SSDT, while rdi contains Table Identifier value. The purpose here, as I said, is to see if the SSN number is relevant to the GUI.</p>
